app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.movie_id = @movie.id

    if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "rating", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "Kick ass"], ["created_at", "2015-02-27 02:59:34.924546"], ["movie_id", 1], ["rating", 5], ["updated_at", "2015-02-27 02:59:34.924546"], ["user_id", 1]]

  def destroy
    @review.destroy
---
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 2]]

    def set_review
      @review = Review.find(params[:id])
---
SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."id" = ? LIMIT 1  [["id", 2]]

    def set_movie
      @movie = Movie.find(params[:movie_id])
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]